; domain
;; The sliding-tile puzzle (i.e. the eight/fifteen/twentyfour puzzle).
;; Tile positions are encoded by the predicate (at <tile> <x> <y>), i.e.
;; using one object for horizontal position and one for vertical (there's
;; a separate predicate for the position of the blank). The predicates
;; "inc" and "dec" encode addition/subtraction of positions.

;; The instance files come in two flavors: The vanilla one uses the same
;; objects for both x and y coordinates, while the other (files that have
;; an "x" at the end of their name) uses different objects for x and y
;; coordinates; this is because some planners seem to require different
;; objects for each parameter of an operator.

(define (domain strips-sliding-tile)
  (:requirements :strips)
  (:predicates
   (tile ?x) (position ?x)
   (at ?t ?x ?y) (blank ?x ?y)
   (inc ?p ?pp) (dec ?p ?pp))

  (:action move-up
    :parameters (?t ?px ?py ?by)
    :precondition (and
		   (tile ?t) (position ?px) (position ?py) (position ?by)
		   (dec ?by ?py) (blank ?px ?by) (at ?t ?px ?py))
    :effect (and (not (blank ?px ?by)) (not (at ?t ?px ?py))
		 (blank ?px ?py) (at ?t ?px ?by)))

  (:action move-down
    :parameters (?t ?px ?py ?by)
    :precondition (and
		   (tile ?t) (position ?px) (position ?py) (position ?by)
		   (inc ?by ?py) (blank ?px ?by) (at ?t ?px ?py))
    :effect (and (not (blank ?px ?by)) (not (at ?t ?px ?py))
		 (blank ?px ?py) (at ?t ?px ?by)))

  (:action move-left
    :parameters (?t ?px ?py ?bx)
    :precondition (and
		   (tile ?t) (position ?px) (position ?py) (position ?bx)
		   (dec ?bx ?px) (blank ?bx ?py) (at ?t ?px ?py))
    :effect (and (not (blank ?bx ?py)) (not (at ?t ?px ?py))
		 (blank ?px ?py) (at ?t ?bx ?py)))

  (:action move-right
    :parameters (?t ?px ?py ?bx)
    :precondition (and
		   (tile ?t) (position ?px) (position ?py) (position ?bx)
		   (inc ?bx ?px) (blank ?bx ?py) (at ?t ?px ?py))
    :effect (and (not (blank ?bx ?py)) (not (at ?t ?px ?py))
		 (blank ?px ?py) (at ?t ?bx ?py)))
  )

; problem
;; Eight puzzle problems:
;; Hard1 and Hard2 are the two "hardest" instances of the puzzle,
;; i.e. having longest solutions (31 steps, see a paper by Reinefeld,
;; IJCAI -95 or -97).

(define (problem hard1)
  (:domain strips-sliding-tile)
  (:objects t1 t2 t3 t4 t5 t6 t7 t8 p1 p2 p3)
  (:init
   (tile t1) (tile t2) (tile t3) (tile t4) (tile t5) (tile t6)
   (tile t7) (tile t8) (position p1) (position p2) (position p3)
   (inc p1 p2) (inc p2 p3) (dec p3 p2) (dec p2 p1)
   (blank p1 p1) (at t1 p2 p1) (at t2 p3 p1) (at t3 p1 p2)
   (at t4 p2 p2) (at t5 p3 p2) (at t6 p1 p3) (at t7 p2 p3)
   (at t8 p3 p3))
  (:goal
   (and (at t8 p1 p1) (at t7 p2 p1) (at t6 p3 p1)
	(at t4 p2 p2) (at t1 p3 p2)
	(at t2 p1 p3) (at t5 p2 p3) (at t3 p3 p3)))
  )

; plan
1. (move-down t3 p1 p2 p1)
   deleted: (blank p1 p1) (at t3 p1 p2)
   added: (blank p1 p2) (at t3 p1 p1)
   goals met: 1 of 8
2. (move-right t4 p2 p2 p1)
   deleted: (blank p1 p2) (at t4 p2 p2)
   added: (blank p2 p2) (at t4 p1 p2)
   goals met: 0 of 8
3. (move-right t5 p3 p2 p2)
   deleted: (blank p2 p2) (at t5 p3 p2)
   added: (blank p3 p2) (at t5 p2 p2)
   goals met: 0 of 8
4. (move-up t2 p3 p1 p2)
   deleted: (blank p3 p2) (at t2 p3 p1)
   added: (blank p3 p1) (at t2 p3 p2)
   goals met: 0 of 8
5. (move-left t1 p2 p1 p3)
   deleted: (blank p3 p1) (at t1 p2 p1)
   added: (blank p2 p1) (at t1 p3 p1)
   goals met: 0 of 8
6. (move-down t5 p2 p2 p1)
   deleted: (blank p2 p1) (at t5 p2 p2)
   added: (blank p2 p2) (at t5 p2 p1)
   goals met: 0 of 8
7. (move-right t2 p3 p2 p2)
   deleted: (blank p2 p2) (at t2 p3 p2)
   added: (blank p3 p2) (at t2 p2 p2)
   goals met: 0 of 8
8. (move-down t8 p3 p3 p2)
   deleted: (blank p3 p2) (at t8 p3 p3)
   added: (blank p3 p3) (at t8 p3 p2)
   goals met: 0 of 8
9. (move-left t7 p2 p3 p3)
   deleted: (blank p3 p3) (at t7 p2 p3)
   added: (blank p2 p3) (at t7 p3 p3)
   goals met: 0 of 8
10. (move-up t2 p2 p2 p3)
   deleted: (blank p2 p3) (at t2 p2 p2)
   added: (blank p2 p2) (at t2 p2 p3)
   goals met: 0 of 8
11. (move-up t5 p2 p1 p2)
   deleted: (blank p2 p2) (at t5 p2 p1)
   added: (blank p2 p1) (at t5 p2 p2)
   goals met: 0 of 8
12. (move-left t3 p1 p1 p2)
   deleted: (blank p2 p1) (at t3 p1 p1)
   added: (blank p1 p1) (at t3 p2 p1)
   goals met: 0 of 8
13. (move-down t4 p1 p2 p1)
   deleted: (blank p1 p1) (at t4 p1 p2)
   added: (blank p1 p2) (at t4 p1 p1)
   goals met: 0 of 8
14. (move-down t6 p1 p3 p2)
   deleted: (blank p1 p2) (at t6 p1 p3)
   added: (blank p1 p3) (at t6 p1 p2)
   goals met: 0 of 8
15. (move-right t2 p2 p3 p1)
   deleted: (blank p1 p3) (at t2 p2 p3)
   added: (blank p2 p3) (at t2 p1 p3)
   goals met: 1 of 8
16. (move-up t5 p2 p2 p3)
   deleted: (blank p2 p3) (at t5 p2 p2)
   added: (blank p2 p2) (at t5 p2 p3)
   goals met: 2 of 8
17. (move-right t8 p3 p2 p2)
   deleted: (blank p2 p2) (at t8 p3 p2)
   added: (blank p3 p2) (at t8 p2 p2)
   goals met: 2 of 8
18. (move-up t1 p3 p1 p2)
   deleted: (blank p3 p2) (at t1 p3 p1)
   added: (blank p3 p1) (at t1 p3 p2)
   goals met: 3 of 8
19. (move-left t3 p2 p1 p3)
   deleted: (blank p3 p1) (at t3 p2 p1)
   added: (blank p2 p1) (at t3 p3 p1)
   goals met: 3 of 8
20. (move-down t8 p2 p2 p1)
   deleted: (blank p2 p1) (at t8 p2 p2)
   added: (blank p2 p2) (at t8 p2 p1)
   goals met: 3 of 8
21. (move-right t1 p3 p2 p2)
   deleted: (blank p2 p2) (at t1 p3 p2)
   added: (blank p3 p2) (at t1 p2 p2)
   goals met: 2 of 8
22. (move-down t7 p3 p3 p2)
   deleted: (blank p3 p2) (at t7 p3 p3)
   added: (blank p3 p3) (at t7 p3 p2)
   goals met: 2 of 8
23. (move-left t5 p2 p3 p3)
   deleted: (blank p3 p3) (at t5 p2 p3)
   added: (blank p2 p3) (at t5 p3 p3)
   goals met: 1 of 8
24. (move-up t1 p2 p2 p3)
   deleted: (blank p2 p3) (at t1 p2 p2)
   added: (blank p2 p2) (at t1 p2 p3)
   goals met: 1 of 8
25. (move-right t7 p3 p2 p2)
   deleted: (blank p2 p2) (at t7 p3 p2)
   added: (blank p3 p2) (at t7 p2 p2)
   goals met: 1 of 8
26. (move-up t3 p3 p1 p2)
   deleted: (blank p3 p2) (at t3 p3 p1)
   added: (blank p3 p1) (at t3 p3 p2)
   goals met: 1 of 8
27. (move-left t8 p2 p1 p3)
   deleted: (blank p3 p1) (at t8 p2 p1)
   added: (blank p2 p1) (at t8 p3 p1)
   goals met: 1 of 8
28. (move-down t7 p2 p2 p1)
   deleted: (blank p2 p1) (at t7 p2 p2)
   added: (blank p2 p2) (at t7 p2 p1)
   goals met: 2 of 8
29. (move-down t1 p2 p3 p2)
   deleted: (blank p2 p2) (at t1 p2 p3)
   added: (blank p2 p3) (at t1 p2 p2)
   goals met: 2 of 8
30. (move-right t5 p3 p3 p2)
   deleted: (blank p2 p3) (at t5 p3 p3)
   added: (blank p3 p3) (at t5 p2 p3)
   goals met: 3 of 8
31. (move-up t3 p3 p2 p3)
   deleted: (blank p3 p3) (at t3 p3 p2)
   added: (blank p3 p2) (at t3 p3 p3)
   goals met: 4 of 8
32. (move-left t1 p2 p2 p3)
   deleted: (blank p3 p2) (at t1 p2 p2)
   added: (blank p2 p2) (at t1 p3 p2)
   goals met: 5 of 8
33. (move-up t7 p2 p1 p2)
   deleted: (blank p2 p2) (at t7 p2 p1)
   added: (blank p2 p1) (at t7 p2 p2)
   goals met: 4 of 8
34. (move-left t4 p1 p1 p2)
   deleted: (blank p2 p1) (at t4 p1 p1)
   added: (blank p1 p1) (at t4 p2 p1)
   goals met: 4 of 8
35. (move-down t6 p1 p2 p1)
   deleted: (blank p1 p1) (at t6 p1 p2)
   added: (blank p1 p2) (at t6 p1 p1)
   goals met: 4 of 8
36. (move-right t7 p2 p2 p1)
   deleted: (blank p1 p2) (at t7 p2 p2)
   added: (blank p2 p2) (at t7 p1 p2)
   goals met: 4 of 8
37. (move-up t4 p2 p1 p2)
   deleted: (blank p2 p2) (at t4 p2 p1)
   added: (blank p2 p1) (at t4 p2 p2)
   goals met: 5 of 8
38. (move-left t6 p1 p1 p2)
   deleted: (blank p2 p1) (at t6 p1 p1)
   added: (blank p1 p1) (at t6 p2 p1)
   goals met: 5 of 8
39. (move-down t7 p1 p2 p1)
   deleted: (blank p1 p1) (at t7 p1 p2)
   added: (blank p1 p2) (at t7 p1 p1)
   goals met: 5 of 8
40. (move-right t4 p2 p2 p1)
   deleted: (blank p1 p2) (at t4 p2 p2)
   added: (blank p2 p2) (at t4 p1 p2)
   goals met: 4 of 8
41. (move-up t6 p2 p1 p2)
   deleted: (blank p2 p2) (at t6 p2 p1)
   added: (blank p2 p1) (at t6 p2 p2)
   goals met: 4 of 8
42. (move-right t8 p3 p1 p2)
   deleted: (blank p2 p1) (at t8 p3 p1)
   added: (blank p3 p1) (at t8 p2 p1)
   goals met: 4 of 8
43. (move-down t1 p3 p2 p1)
   deleted: (blank p3 p1) (at t1 p3 p2)
   added: (blank p3 p2) (at t1 p3 p1)
   goals met: 3 of 8
44. (move-left t6 p2 p2 p3)
   deleted: (blank p3 p2) (at t6 p2 p2)
   added: (blank p2 p2) (at t6 p3 p2)
   goals met: 3 of 8
45. (move-left t4 p1 p2 p2)
   deleted: (blank p2 p2) (at t4 p1 p2)
   added: (blank p1 p2) (at t4 p2 p2)
   goals met: 4 of 8
46. (move-up t7 p1 p1 p2)
   deleted: (blank p1 p2) (at t7 p1 p1)
   added: (blank p1 p1) (at t7 p1 p2)
   goals met: 4 of 8
47. (move-right t8 p2 p1 p1)
   deleted: (blank p1 p1) (at t8 p2 p1)
   added: (blank p2 p1) (at t8 p1 p1)
   goals met: 5 of 8
48. (move-right t1 p3 p1 p2)
   deleted: (blank p2 p1) (at t1 p3 p1)
   added: (blank p3 p1) (at t1 p2 p1)
   goals met: 5 of 8
49. (move-down t6 p3 p2 p1)
   deleted: (blank p3 p1) (at t6 p3 p2)
   added: (blank p3 p2) (at t6 p3 p1)
   goals met: 6 of 8
50. (move-left t4 p2 p2 p3)
   deleted: (blank p3 p2) (at t4 p2 p2)
   added: (blank p2 p2) (at t4 p3 p2)
   goals met: 5 of 8
51. (move-up t1 p2 p1 p2)
   deleted: (blank p2 p2) (at t1 p2 p1)
   added: (blank p2 p1) (at t1 p2 p2)
   goals met: 5 of 8
52. (move-left t8 p1 p1 p2)
   deleted: (blank p2 p1) (at t8 p1 p1)
   added: (blank p1 p1) (at t8 p2 p1)
   goals met: 4 of 8
53. (move-down t7 p1 p2 p1)
   deleted: (blank p1 p1) (at t7 p1 p2)
   added: (blank p1 p2) (at t7 p1 p1)
   goals met: 4 of 8
54. (move-right t1 p2 p2 p1)
   deleted: (blank p1 p2) (at t1 p2 p2)
   added: (blank p2 p2) (at t1 p1 p2)
   goals met: 4 of 8
55. (move-up t8 p2 p1 p2)
   deleted: (blank p2 p2) (at t8 p2 p1)
   added: (blank p2 p1) (at t8 p2 p2)
   goals met: 4 of 8
56. (move-left t7 p1 p1 p2)
   deleted: (blank p2 p1) (at t7 p1 p1)
   added: (blank p1 p1) (at t7 p2 p1)
   goals met: 5 of 8
57. (move-down t1 p1 p2 p1)
   deleted: (blank p1 p1) (at t1 p1 p2)
   added: (blank p1 p2) (at t1 p1 p1)
   goals met: 5 of 8
58. (move-right t8 p2 p2 p1)
   deleted: (blank p1 p2) (at t8 p2 p2)
   added: (blank p2 p2) (at t8 p1 p2)
   goals met: 5 of 8
59. (move-right t4 p3 p2 p2)
   deleted: (blank p2 p2) (at t4 p3 p2)
   added: (blank p3 p2) (at t4 p2 p2)
   goals met: 6 of 8
60. (move-up t6 p3 p1 p2)
   deleted: (blank p3 p2) (at t6 p3 p1)
   added: (blank p3 p1) (at t6 p3 p2)
   goals met: 5 of 8
61. (move-left t7 p2 p1 p3)
   deleted: (blank p3 p1) (at t7 p2 p1)
   added: (blank p2 p1) (at t7 p3 p1)
   goals met: 4 of 8
62. (move-left t1 p1 p1 p2)
   deleted: (blank p2 p1) (at t1 p1 p1)
   added: (blank p1 p1) (at t1 p2 p1)
   goals met: 4 of 8
63. (move-down t8 p1 p2 p1)
   deleted: (blank p1 p1) (at t8 p1 p2)
   added: (blank p1 p2) (at t8 p1 p1)
   goals met: 5 of 8
64. (move-right t4 p2 p2 p1)
   deleted: (blank p1 p2) (at t4 p2 p2)
   added: (blank p2 p2) (at t4 p1 p2)
   goals met: 4 of 8
65. (move-up t1 p2 p1 p2)
   deleted: (blank p2 p2) (at t1 p2 p1)
   added: (blank p2 p1) (at t1 p2 p2)
   goals met: 4 of 8
66. (move-right t7 p3 p1 p2)
   deleted: (blank p2 p1) (at t7 p3 p1)
   added: (blank p3 p1) (at t7 p2 p1)
   goals met: 5 of 8
67. (move-down t6 p3 p2 p1)
   deleted: (blank p3 p1) (at t6 p3 p2)
   added: (blank p3 p2) (at t6 p3 p1)
   goals met: 6 of 8
68. (move-left t1 p2 p2 p3)
   deleted: (blank p3 p2) (at t1 p2 p2)
   added: (blank p2 p2) (at t1 p3 p2)
   goals met: 7 of 8
69. (move-left t4 p1 p2 p2)
   deleted: (blank p2 p2) (at t4 p1 p2)
   added: (blank p1 p2) (at t4 p2 p2)
   goals met: 8 of 8
